"""
Задача №7.
Дано натуральное число. Требуется определить,
является ли год с данным номером високосным. Если
год является високосным, то выведите YES, иначе
выведите NO. Напомним, что в соответствии с
григорианским календарем, год является
високосным, если его номер кратен 4, но не кратен
100, а также если он кратен 400.
"""

year = int(input('Введите номер года: '))

leap_year_val = bool(year%4 == 0) - bool(year%100 == 0) + bool(year%400 == 0)

if leap_year_val:
    print('YES')
else:
    print('NO')
