# Задача 10:
# На столе лежат n монеток.
# Некоторые из них лежат вверх решкой, а некоторые – гербом.
# Определите минимальное число монеток, которые нужно перевернуть,
# чтобы все монетки были повернуты вверх одной и той же стороной.
# Выведите минимальное количество монет, которые нужно перевернуть

from random import randint

n = int(input('Coins\' number: '))

count = 0
for _ in range(n):
    if randint(0, 1) == 0: # условие выпадения одной стороны монеты, условно 0
        count += 1

min_turn_number = count if count <= n // 2 else n - count
print(min_turn_number)
