"""
Задача 6: Вы пользуетесь общественным транспортом?
Вероятно, вы расплачивались за проезд и получали билет с номером.
Счастливым билетом называют такой билет с шестизначным номером,
 где сумма первых трех цифр равна сумме последних трех.
 Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6.
 Вам требуется написать программу, которая проверяет счастливость билета.

*Пример:*

385916 -> yes
123456 -> no
"""


def digit_sum(number):
    return number // 100 + (number % 100) // 10 + number % 10


num = input("Введите шестизначное число: ")

if len(num) == 6:
    num = int(num)
    print(num, end=" -> ")

    if digit_sum(num // 1000) == digit_sum(num % 1000):
        print("yes")
    else:
        print("no")

else:
    print("Вы ввели не шестизначное число!")
