# В фермерском хозяйстве в Карелии выращивают чернику. Она растёт на круглой грядке,
# причём кусты высажены только по окружности.
# Таким образом, у каждого куста есть ровно два соседних.
# Всего на грядке растёт N кустов.
# Эти кусты обладают разной урожайностью,
# поэтому ко времени сбора на них выросло различное число ягод
# — на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.\
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.\
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом,
# собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод,
# которое может собрать за один заход собирающий модуль,
# находясь перед некоторым кустом заданной во входном файле грядки.

import random

num_n = int(input('Enter the bush number: '))
print(list_a := [random.randint(0,10) for _ in range(num_n)])

# var#1
# max_harv = 0
# for i in range(len(list_a)):
#     if list_a[0] + list_a[1] + list_a[2] > max_harv:
#         max_harv = list_a[0] + list_a[1] + list_a[2]
#     list_a.append(list_a.pop(0))
#     # print(list_a)
# print(max_harv)

# var#2
# max_harv = 0
# for i in range(len(list_a)-1):
#     if list_a[i - 1] + list_a[i] + list_a[i + 1] > max_harv:
#         max_harv = list_a[i - 1] + list_a[i] + list_a[i + 1]
# if list_a[len(list_a) - 2] + list_a[len(list_a) - 1] + list_a[0] > max_harv:
#     max_harv = list_a[len(list_a) - 2] + list_a[len(list_a) - 1] + list_a[0]
# print(max_harv)
