# В фермерском хозяйстве в Карелии выращивают чернику. Она растёт на круглой грядке,
# причём кусты высажены только по окружности.
# Таким образом, у каждого куста есть ровно два соседних.
# Всего на грядке растёт N кустов.
# Эти кусты обладают разной урожайностью,
# поэтому ко времени сбора на них выросло различное число ягод
# — на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.\
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.\
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом,
# собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод,
# которое может собрать за один заход собирающий модуль,
# находясь перед некоторым кустом заданной во входном файле грядки.

import random

N = int(input('Enter the bush number: '))
print(A := [random.randint(0,10) for _ in range(N)])

# var#1
# max_harv = 0
# for i in range(len(A)):
#     if A[0] + A[1] + A[2] > max_harv:
#         max_harv = A[0] + A[1] + A[2]
#     A.append(A.pop(0))
#     # print(A)
# print(max_harv)

# var#2
# max_harv = 0
# for i in range(len(A)-1):
#     if A[i - 1] + A[i] + A[i + 1] > max_harv:
#         max_harv = A[i - 1] + A[i] + A[i + 1]
# if A[len(A) - 2] + A[len(A) - 1] + A[0] > max_harv:
#     max_harv = A[len(A) - 2] + A[len(A) - 1] + A[0]
# print(max_harv)
