# Задача 12:
# Петя и Катя – брат и сестра.
# Петя – студент, а Катя – школьница.
# Петя помогает Кате по математике.
# Он задумывает два натуральных числа X и Y (X,Y≤1000),
# а Катя должна их отгадать.
# Для этого Петя делает две подсказки.
# Он называет сумму этих чисел S и их произведение P.
# Помогите Кате отгадать задуманные Петей числа.

from random import randint

X = randint(1, 1000)
Y = randint(1, 1000)

S = X + Y
P = X * Y

print(X, Y, S, P)

# Вариант 1
# for i in range(1, S // 2):
#     if P / i == S - i:
#         print(i, S - i)
#         break

# Вариант 2
i = 1
while P/i != S - i:
    i += 1
print(i, S - i)